<script setup lang="ts">
import BaseAccordion from '~/components/base/BaseAccordion.vue'
import { IAccordion } from '~/interfaces/IAccordion'

const accordions: IAccordion[] = [
  {
    id: 1,
    title: 'Сколько стоит ремонт?',
    text: 'Стоимость ремонта определяется сметой и зависит от уровня сложности проекта.'
  },
  {
    id: 2,
    title: 'Сколько длится ремонт?',
    text: 'Все проекты индивидуальны. Сроки зависят от сложности проекта. Квартиру 100м можно реализовать за 4-5 месяцев.'
  },
  {
    id: 3,
    title: 'Кто работает на объекте?',
    text: 'На объекте трудятся специалисты, чьи профессиональные навыки ориентированы на конкретную область, с опытом работы от 5 лет и более.'
  },
  {
    id: 4,
    title: 'Мне нужен проект для ремонта?',
    text: 'Если у вас имеется дизайн-проект на руках, то мы будем с удовольствием работать по нему. Если проекта у вас нет, то мы с радостью разработаем его вместе с нами.'
  },
  {
    id: 5,
    title: 'Кто контролирует ремонт?',
    text: 'Ваш ремонт выполняется командой. Ваш проект ведет один специалист, который контролирует все процессы.'
  },
  {
    id: 6,
    title: 'Как происходит оплата?',
    text: 'Оплата происходит согласно графику платежей. Обычно это 5 этапов по 20%. Каждый платеж оплачивается перед началом нового этапа в виде аванса. После сдачи этапа и подписания акта клиент вносит платеж за новый этап.'
  },
  {
    id: 7,
    title: 'Кто закупает оборудование?',
    text: 'Мы закупаем все необходимые материалы, что обеспечивает своевременность поставок на объект, а также позволяет Вам экономить благодаря нашим скидкам у поставщиков.'
  },
  {
    id: 8,
    title: 'Какая гарантия на ремонт?',
    text: 'Гарантия на работы 24 месяца. После сдачи объекта мы остаемся на связи и помогаем разобраться с любыми возникшими вопросами по ремонту.'
  },
  {
    id: 9,
    title: 'Как часто мне нужно бывать на объекте?',
    text: 'Всё зависит от того, сколько свободного времени и желания у Вас имеется. Иногда клиенты приезжают на стройку дважды: первый раз - чтобы передать ключи, второй раз - чтобы ознакомиться с результатом ремонта. Клиенты получают фотоотчёт со стройки регулярно.'
  },
  {
    id: 10,
    title: 'Почему я должен вам доверять?',
    text: 'Завершенные проекты подтверждены портфолио, мы готовы показать текущие объекты в работе. Опыт работы 20+ лет. Наша репутация бренда и компании подкрепляется официальным договором.'
  },
  {
    id: 11,
    title: 'Делаете ли вы частичный ремонт?',
    text: 'Да, мы предоставляем разные услуги. Каждая ситуация индивидуальна. Подробнее можете узнать на консультации.'
  },
  {
    id: 12,
    title: 'Через сколько вы можете приступить к ремонту?',
    text: 'Мы нуждаемся в 1-2 неделях после заключения контракта, чтобы подготовиться к работе. В этот период мы разрабатываем план работ, составляем рабочую документацию, обеспечиваем общение с заказчиком, закупаем необходимые материалы, доставляем инструменты и обустройство локации. Только после этого мы начинаем выполнение работ.'
  }
]
</script>

<template>
  <section id="faq" class="faq w">
    <div class="container faq__content">
      <h2 class="h2 faq__title">
        Вопрос ответ
      </h2>
      <div class="faq__accordions">
        <BaseAccordion
          v-for="accordion in accordions"
          :key="accordion.id"
          :accordion="accordion"
        />
      </div>
    </div>
  </section>
</template>

<style scoped lang="scss">
.faq {
  &__accordions {
    margin-top: 30px;
    display: grid;
    grid-template-columns: 1fr;
    gap: 25px;
  }
}
</style>
